
## Terraform plan for environment: `dev`

**Commit:** 06012ef451385b3fab961463a6affc32331f70b5


**API version:** f7c780e623
**CLI version:** f7c780e623
**Selfserve version:** f7c780e623
**Internal version:** f7c780e623
**search version:** d68f999c67

### Plan summary

`2 to add, 6 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.module.ecs_service["search"].aws_ecs_task_definition.this[0]
module.service.module.sns_batch_failure.aws_sns_topic_subscription.this["vol-app-dev-batch-failure-email-olcs-dev"]
```
**📖 Reads**

```tf
module.service.module.ecs_service["search"].data.aws_ecs_task_definition.this[0]
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_definition.this["import-anondb"]
module.service.module.batch.aws_batch_job_definition.this["ni-compliance"]
module.service.module.batch.aws_batch_job_definition.this["populate-anondb"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.ecs_service["search"].aws_ecs_service.this[0]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.service.module.batch.aws_batch_job_definition.this["import-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-anondb:97" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "f7c780e623"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "f7c780e623"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-anondb:97"
        name                       = "vol-app-dev-import-anondb"
      ~ revision                   = 97 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ni-compliance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ni-compliance:97" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "f7c780e623"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "f7c780e623"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ni-compliance:97"
        name                       = "vol-app-dev-ni-compliance"
      ~ revision                   = 97 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["populate-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-populate-anondb:97" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "f7c780e623"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "f7c780e623"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-populate-anondb:97"
        name                       = "vol-app-dev-populate-anondb"
      ~ revision                   = 97 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-sas-mi-extract:97" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "f7c780e623"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "f7c780e623"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-sas-mi-extract:97"
        name                       = "vol-app-dev-sas-mi-extract"
      ~ revision                   = 97 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.ecs_service["search"].data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "vol-app-dev-search-service"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.service.module.ecs_service["search"].aws_ecs_service.this[0] will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:054614622558:service/vol-app-dev-search-cluster/vol-app-dev-search-service"
        name                               = "vol-app-dev-search-service"
        tags                               = {}
      ~ task_definition                    = "vol-app-dev-search-service:43" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.service.module.ecs_service["search"].aws_ecs_task_definition.this[0] must be replaced
+/- resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-dev-search-service:43" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-dev-search-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ cpu                    = 2048 -> 4096
                  ~ memory                 = 4096 -> 8192
                    name                   = "search"
                    # (17 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ cpu                      = "2048" -> "4096" # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "vol-app-dev-search-service" -> (known after apply)
      ~ memory                   = "4096" -> "8192" # forces replacement
      ~ revision                 = 43 -> (known after apply)
      - tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "batch:SubmitJob",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cancel-unsubmitted-bilateral:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ch-vs-olcs-diffs:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-clean-up-variations:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-close-expired-windows:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cns:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-company-profile-dlq:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-create-psv-licence-surrender-task:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-delete:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-populate:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-postcheck:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-precheck:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-database-maintenance:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-digital-continuation-reminders:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-warning:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-enqueue-ch-compare:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-expire-bus-registration:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-flag-urgent-tasks:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-users-from-csv:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-inspection-request-email:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-interim-end-date-enforcement:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-international-goods-export:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-last-tm-letter:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-licence-status-rules:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-liquibase:7",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-mark-expired-permits:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-cl:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-company-profile:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency-dlq:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-community-licences:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-generation:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-print:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-ecmt-accept:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-general:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-irhp-allocate:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-generation:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-print:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-print:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-psv-operator-list-export:206",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-remove-read-audit:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-resolve-payments:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-search:5",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-system-parameter:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-transxchange-consumer:203",
              + "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default",
              + "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-liquibase",
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "batch"
        }
    }

  # module.service.module.eventbridge.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id               = "arn:aws:iam::054614622558:policy/vol-app-dev-batch-scheduler-inline"
        name             = "vol-app-dev-batch-scheduler-inline"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "batch:SubmitJob"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-liquibase",
                          - "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-transxchange-consumer:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-system-parameter:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-search:5",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-sas-mi-extract:97",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-resolve-payments:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-remove-read-audit:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-psv-operator-list-export:206",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-print:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-print:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-generation:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-irhp-allocate:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-general:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-ecmt-accept:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-print:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-generation:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-community-licences:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency-dlq:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-company-profile:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-cl:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-populate-anondb:97",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ni-compliance:97",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-mark-expired-permits:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-liquibase:7",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-licence-status-rules:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-last-tm-letter:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-international-goods-export:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-interim-end-date-enforcement:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-inspection-request-email:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-users-from-csv:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-anondb:97",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-flag-urgent-tasks:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-expire-bus-registration:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-enqueue-ch-compare:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-warning:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-digital-continuation-reminders:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-database-maintenance:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-precheck:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-postcheck:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-populate:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-delete:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-create-psv-licence-surrender-task:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-company-profile-dlq:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cns:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-close-expired-windows:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-clean-up-variations:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ch-vs-olcs-diffs:203",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cancel-unsubmitted-bilateral:203",
                        ]
                      - Sid      = "batch"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Name" = "vol-app-dev-batch-scheduler-inline"
        }
        # (7 unchanged attributes hidden)
    }

  # module.service.module.sns_batch_failure.aws_sns_topic_subscription.this["vol-app-dev-batch-failure-email-olcs-dev"] will be created
  + resource "aws_sns_topic_subscription" "this" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "olcs-dev@otc.gov.uk"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:eu-west-1:054614622558:vol-app-dev-batch-failure-topic-20241009122927526300000002"
    }

Plan: 2 to add, 6 to change, 1 to destroy.

```

</details>